import { useTranslations } from "next-intl";
import styles from "../../../../styles/AuthorPage.module.scss"
import Image from "next/image";

export const metadata = {
  title: "Info гастро гіда",
  description:
    "Довідник для гастрономічного гіда. Що таке харчова цінність та як визначається, розрахунок калорійності, білків, жирів, вуглеводів. Корисні властивості харчових продуктів.",
};

export default function AuthorPage() {
  const t = useTranslations("InfoPage");
  return (
    <>
      <h1 className="sectionTitle">Про автора</h1>
      <div className={styles.author__container}>
        <p>
          Ласкаво прошу на унікальний та пізнавальний ресурс! Мене звуть Шеремет
          Єлизавета, і я народилася у чудовому місті Одеса, яке знаходиться в
          Україні. Я володію двома вищими освітами: одна в галузі технологій
          харчування, а інша в комп'ютерних науках. Той проект, з яким ви зараз
          знайомитеся, є результатом моєї магістерської роботи з другої вищої
          освіти. Враховуючи актуальність обох галузей, у мене з'явилася
          приголомшлива ідея об'єднати ці знання та створити цікавий
          інформаційний ресурс, в який я вклала всі отримані мною знання в обох
          галузях, доповнених даними з інтернету та літератури. Для мене це не
          просто дипломна робота чи ще один проект, я вкладаю душу у кожне слово
          та думку, які хочу передати суспільству. Я впевнена, що цей ресурс
          стане справжньою знахідкою для мандрівників, гурманів та всіх, кому
          цікаво пізнавати нове.
        </p>
        <Image
          src="/aboutauthor1.jpg"
          alt="Шеремет Єлизавета - автор сайту гастро гід"
          width={350}
          height={300}
          className={styles.authorImage}
        />
      </div>
      <div className={styles.author__container__rev}>
        <p>
          Мої знання у сфері харчування людини підкріплені як теорією, так і
          практикою. Я перевіряла та застосовувала безліч теоретичних знань під
          час приготування страв, проводила різні експерименти, які враховувала
          при збиранні всієї необхідної інформації, якою зараз ділюся з вами
          тут. У мене також є особистий кулінарний блог у Instagram , YouTube,
          де можна переглянути процеси приготування деяких страв, які
          представлені на цьому сайті. Я завжди відкрита для будь-яких
          пропозицій та зауважень, оскільки вони допоможуть зробити цей ресурс
          максимально корисним для кожного. Мені хочеться продовжувати розвивати
          цей проект, покращувати інтерфейс, додавати нові можливості,
          наповнювати його новими рецептами, оновлювати дані про продукти, і
          тому я буду рада будь-якому зворотному зв'язку. Адже розвиватись треба
          разом.
        </p>
        <Image
          src="/aboutauthor1.jpg"
          alt="Шеремет Єлизавета - автор сайту гастро гід"
          width={350}
          height={300}
          className={styles.authorImage}
        />
      </div>
      <p className={styles.author__text}>
        Також хочу згадати людей без котрих нічого б цього не вийшло - звісно,
        це сімʼя. Я маю велику найпрекраснішу в світі сімʼю, яка підтримує мене
        в моїх ідеях та надихає на розвиток. Я пишаюсь тим, що зараз можу вам
        розповісти, адже кожен з них вклав в цей проект свою увагу, знання та
        величезну допомогу. Всі мої родичі фанати їжі, та не просто любетилі, а
        справжні ентузіасти, що завжди шукають нові смаки та враження. Більш
        того вся моя родина, включаючи мене, є рибалками, та ще й якими. Отже, я
        хочу розповісти про кожного та познайомити вас.
      </p>
      <div className={styles.author__container}>
        <p>
          Мій батько, Михайло Миколайович Шеремет, - це справжній ентузіаст
          риболовлі та кулінарії. Разом з ним ми часто експериментуємо з
          цікавими рецептами та наповнюємо наш дім ароматами автентичних страв,
          таких як аргентинський Асадо чи улюблена французька кухня з
          традиційним рататуєм або королем соусів - бешамелем. Звісно,
          враховуючи, що ми рибалки, обробка та приготування власноруч спійманої
          риби - звичайна справа. І авжеж, ми фанати морських жителів, бо живемо
          у перлині біля моря, Одесі. До речі, за деяку інформацію на гастро
          гіді відповідав батько, він один із небагатьох, кому я можу довірити
          такі важливі речі, як достовірні дані.
        </p>
        <Image
          src="/aboutauthor1.jpg"
          alt="Шеремет Єлизавета - автор сайту гастро гід"
          width={350}
          height={300}
          className={styles.authorImage}
        />
      </div>
      <div className={styles.author__container__rev}>
        <p>
          Моя мати, Оксана Володимирівна Шеремет,водночас рибалка та аматорка
          кулінарії, що завжди приділяє спеціальну увагу сімейним вечерям,
          особливо в період, коли моє навчання університеті забирало більше мого
          часу. Її спогади про те, як у мене в чотири роки вже була
          високорозвинена здатність розрізняти білий перець від чорного, завжди
          змушують нас сміятися. Моя мама справжня фанатка азіатської кухні, та
          часто балує нас стравами саме тих регіонів, ото як смажений рис з
          овочами та яйцем, або ж яловичина у кисло-солодкому соусі. Мама також
          приймала активну участь у пошуку інформації для вас, та так
          захопилась, що навіть потрапила на одну програму, але це поки
          таємниця.
        </p>
        <Image
          src="/aboutauthor1.jpg"
          alt="Шеремет Єлизавета - автор сайту гастро гід"
          width={350}
          height={300}
          className={styles.authorImage}
        />
      </div>
      <div className={styles.author__container}>
        <p>
          Моя старша сестра, Катерина Михайлівна Мазуренко (за дівочим прізвищем
          Шеремет), - це рибалка, блогер та закоханий в кулінарію ентузіаст, яка
          точно розумється в різниці між устрицями і вміє вживати їх правильно.
          У нашому дитинстві Катя і я багато допомагали батькам по дому,що
          призвело до того, що вона часто готувала, і, за моїми спостереженнями,
          полюбила кулінарне мистецтво. Щодня вона все більше і більше поринає в
          світ кулінарії, тому важко визначити її найулюбленішу страву, оскільки
          Катерина, як справжній гурман, завжди шукає нові смаки або може
          насолоджуватися просто вечерею з картоплею і селедкою. Саме Катя
          допомагає рекламувати та популяризувати Гастро гід, надихаючи
          суспільство на нові кулінарні відкриття. Можливо, ви вже є
          шанувальником моєї сестри-рибалки, а якщо ні, то будь ласка, завітайте
          на її канал та інші соціальні мережі.
        </p>
        <Image
          src="/aboutauthor1.jpg"
          alt="Шеремет Єлизавета - автор сайту гастро гід"
          width={350}
          height={300}
          className={styles.authorImage}
        />
      </div>
      <p className={styles.author__text}>
        Також я не хочу забувати про інших членів нашої родини, які вклали свою
        участь до цього проекту ще з моменту мого народження. Це найпрекрасніші
        бабусі і дідусі, яким я дзвоню всякий раз, коли забуваю пропорцій страв
        або хочу приготувати щось, повʼязане з мого дитинства, що робили вони.
        Більш того, моя прабабуся була також технологом харчування, певно її
        захоплення передалось мені більш за всіх, два технологи харчування крізь
        два покоління.
      </p>
      <p className={styles.author__text}>
        Усі вище перелічені люди є моїм натхненням та допомогою в цьому
        культурному проекті. Кожен з них вклав сюди, як і я, частинку своєї
        душі. Як ви бачите, родина, традиції, виховання, звичаї тісно зв’язані
        із культурою харчування та кулінарним мистецтвом, що передається з
        покоління в покоління та продовжує кулінарну спадщину.
      </p>
      <p className={styles.author__text}>
        Дякую вам за увагу та знайомство зі мною і моєю родиною. Я сподіваюся,
        що вам сподобається наш гастрономічний гід. Приємної подорожі світом
        смаків!
      </p>
    </>
  );
}
