{
     "Header":{
       "home": "Home",
       "continents": "Continents",
       "countries": "Countries",
       "recipes": "Recipes",
       "products": "Products",
       "manual": "Manual",
       "contacts": "Contacts",
       "author": "About author",
       "resource": "About resource",
       "auth": "Log in",
       "registrate": "Registration"
    },
  "Home": {
    "title": "World cuisine Traditions and Benefits",
    "greenland": "Greenland",
    "na": "North America",
    "sa": "South America",
    "asia": "Asia",
    "eu": "Europe",
    "africa": "Africa",
    "au": "Australia",
    "about":{
      "title": "About the resource",
      "descriptions": {
        "global": "- your personal culinary guide in the world, offering an exiting journey through diverse gastronomic cultures. It’s a famous fact that food is an essential need of life and it also has social and cultural significance. Moreover, we can enjoy the taste and smell of food which lifts our mood and improves our well-being . In the different countries there are unique traditions of cooking food, features of the use of products and culinary arts with rich story." ,
        "info": "is a source of information, filled with interesting facts of different cultures and food traditions around the world. The second topic in this application is information about benefits of nutrition and the effect of products on the human body. You need to remember that nutrition is more important than anything else.",
        "pages": "On each county page you can find really exciting information about that county’s food, traditional dishes, local products and culture. A detailed recipe and useful properties of this dish are described on each page of the dish. You can use this app to determine the benefits of your own food intake.",
        "data": "In addition , other pages present valuable macronutrient and micronutrient data that are included in the products. You can also find the full chemical composition of the most popular products. This data will be added and updated regularly."
      }
    },
    "author":{
      "title": "About the author",
      "description": {
        "greatest": "Hello there! I'm pleased to welcome you to my unique informative resource. My name is Elizabeth, I’m from Ukraine, from beautiful city Odesa.",
        "education": "I have two higher degrees, one in the field of food technology and the other in computer science. This website is my personal project for my master's diploma in my second field of study. I believe that both of these fields are truly important and relevant in our lives, so I decided to merge them and create an engaging informational resource. I've incorporated all of my knowledge from both directions into this application, complementing it with data from the internet and literature.",
        "meaning": "This application is not just a diploma or a simple project for me, because I put my heart into every word that I want to convey to society. I believe that the resource will be a real find for travelers, food enthusiasts and everyone who is interested in learning new things.",
        "experience": "My knowledge in the food industry is supported by both theory and practice. I tested and applied a lot of theoretical knowledge while cooking, conducted various experiments, which I took into account when collecting all the necessary information that I share with you here.",
        "blog": {
          "part1": "I also have a personal culinary blog on ",
          "part2": " where you can see the cooking processes of some of the dishes presented on this website. I'm always open to any suggestions and comments because it will help make the resource as useful as possible for everyone. I would like to continue to develop this project, improve the interface, add new features, fill it with new recipes, update product data, which is why I'll be glad for any feedback. I think we need to develop together."
        },
        "gratitude": "Thank you for your attention and getting to know me. I hope you will like my gastronomic guide. Enjoy your journey through the world of flavors!"
      }
    }
  },
  "Travel": {
    "title": "Let's start you journey!",
    "choose": {
      "continent": "Choose continent",
      "country": "Choose country"
    }
  },
   "Contacts": {
         "title": "Contacts",
         "feedback": "Feedback",
         "socialmedia": "Social Media",
         "socialAuthor": "Author's social networks"
  },
  "Footer": {
    "navigation": "Site navigation",
    "home": "Home",
       "continents": "Continents",
       "countries": "Countries",
       "recipes": "Recipes",
       "products": "Products",
       "manual": "Manual",
       "contacts": "Contacts",
       "author": "About author",
       "resource": "About resource",
       "feedback": "Feedback"
  },
  "ContinentsPage": {
    "title": "Сontinental cuisine",
    "section": {
        "title": "Continental cuisine",
        "description": {
          "part1": "Historically, our huge and rich planet Earth has been divided into different areas - continents. Each of them has its own unique features, traditions of food, growing products and breeding livestock and birds. However, there is one of the continents that is not suitable either for growing food, or for breeding livestock, or for the development of food culture in general.",
          "part2": "This continent is Antarctica, which is associated with permafrost. Due to the peculiarities of the geographical location and climate in Antarctica, it is impossible to enjoy the processes of cooking and creating culinary masterpieces. The main way of eating in Antarctica is the import of various canned goods and frozen semi-finished products. While other continents have a rich culinary history, unique traditions of eating and cooking. Let's consider each of them in more detail, because every corner of our beautiful world deserves attention and contributes to the culinary history of the world community."
        },
        "europe":{
          "title":"Europe",
          "features": {
            "first": "A wide variety of cuisines in different European countries: French, Italian, Spanish, Greek, German and many others.",
            "second": "Use of meat: beef, pork, lamb and poultry, consumption of dairy products as an important source of protein and calcium.",
            "third": "Use of olives, olive oil, grapes, bread and wheat."
          }
        },
        "africa":{
          "title":"Africa",
          "features": {
            "first": "The use of meat such as goat, ram, crocodile, zebra and other wild animals.",
            "second": "The most popular dishes: couscous, jollof rice, boboti, braai (East African barbecue).",
            "third": "A wealth of tropical fruits and vegetables, including bananas, mangoes, papayas, ailanthus, coconuts.",
            "fourth": "Use lots of spices like curry and harissa."
          }
        },
        "asia":{
          "title":"Asia",
          "features": {
            "first": "Variety of Asian cuisine: Chinese, Indian, Japanese, Thai, Korean, Vietnamese.",
            "second": "The use of rice, soybeans, fish, seafood, the use of various spices: turmeric, curry, ginger, lemongrass and other traditional ingredients.",
            "third": "A variety of cooking techniques such as boiling, roasting, steaming and fermenting."
          }
        },
        "northamerica":{
          "title":"North America",
          "features": {
            "first": "High consumption of meat: beef, pork and poultry, as well as seafood: lobster, shrimp and mussels.",
            "second": "The use of wheat for the production of bread, pasta and other bakery products.",
            "third": "Traditional dishes: hamburgers, hot dogs, steaks, Mexican cuisine (tacos and burritos), seafood (lobsters, mussels, shrimp)."
          }
        },
        "southamerica":{
          "title":"South America",
          "features": {
            "first": "Enriched with a variety of foods, including potatoes, corn, beans, pumpkin, meat, fish and tropical fruits.",
            "second": "Using traditional ingredients: quinoa, aleuros, quintales.",
            "third": "Traditional dishes: arroz con pollo (meat with rice), asado (steamed meat), guacamole, empanadas (stuffed pies)."
          }
        },
        "australia":{
          "title":"Australia(Oceania)",
          "features": {
            "first": "Plenty of meat, including lamb, beef, kangaroo and fish from the Pacific ocean, used in Australian cuisine.",
            "second": "Popular dishes: barbecue, lamb chops, kangaroo burgers, seafood.",
            "third": "Eating many tropical fruits that grow in this region."
          }
        },
        "textbtn": "Visit the continent"
    }
  },
   "CountriesPage": {
    "title": "Cuisine of the countries"
  },
   "RecipesPage": {
    "title": "Recipes of the world"
  },
   "ProductsPage": {
    "title": "Food products"
  },
   "ManualPage": {
    "title": "Manual"
  },
   "SouthAmerica": {
    "title": {
      "part1": "Cuisine and traditions of the continent",
      "part2": "South America"
    },
    "countriesTitle": "Countries of the South American continent"
  },
   "NorthAmerica": {
    "title": {
      "part1": "Cuisine and traditions of the continent",
      "part2": "North America"
    },
    "countriesTitle": "Countries of the North American continent"
  },
   "Africa": {
    "title": {
      "part1": "Cuisine and traditions of the continent",
      "part2": "Africa"
    },
    "countriesTitle": "Countries of the Africa continent"
  },
   "Asia": {
    "title": {
      "part1": "Cuisine and traditions of the continent",
      "part2": "Asia"
    },
    "countriesTitle": "Countries of the Asian continent"
  },
   "Europe": {
    "title": {
      "part1": "Cuisine and traditions of the continent",
      "part2": "Europe"
    },
    "countriesTitle": "Countries of the European continent"
  },
   "Australia": {
    "title": {
      "part1": "Cuisine and traditions of the continent",
      "part2": "Australia(Oceania)"
    },
    "countriesTitle": "Countries of the Australian continent"
  },
  "CountryPage": {
    "featuresTitle": "Features of the country",
    "historyTitle": "History of the origin of cooking in the country",
    "seasonsTitle": "Seasonal products",
    "dishesTitle": "Traditional dishes of the country"
  },
  "RecipePage": {
    "featuresTitle": "Features of the dish",
    "measures": "g",
    "recipeTitle": "Recipe of the dish",
    "cookTitle": "Cooking technology",
    "nutritionalTitle": "Nutritional value",
    "nutritionalValues": {
      "portion": "Portion(~300g):",
      "proteins": "Proteins:",
      "fats": "Fats:",
      "carbohydrates": "Carbohydrates:",
      "calories": "Energy:",
      "attention": "*Attention! It is important to remember! All proteins, fats, carbohydrates and caloric content calculations vary depending on the quality of the ingredients, the cooking process and other factors. This means that all calculations can be as close as possible to real ones, but cannot be 100% accurate.",
      "measures":{
        "g": "g",
        "mg": "mg",
        "cal": "cal"
      }
      } 
    },
  "Buttons": {
    "more": "Show more",
    "collapse": "Collapse"
  }
}