{
    "Header":{
       "home": "Головна",
       "continents": "Континенти",
       "countries": "Країни",
       "recipes": "Рецепти",
       "products": "Продукти",
       "manual": "Довідник",
       "contacts": "Контакти",
       "author": "Про автора",
       "resource": "Про ресурс",
       "auth": "Увійти",
       "registrate": "Створити"
    },
    "Home": {
    "title": "Кухні світу Традиції та особливості",
    "greenland": "Гренландія",
    "na": "Північна Америка",
    "sa": "Південна Америка",
    "asia": "Азія",
    "eu": "Европа",
    "africa": "Африка",
    "au": "Австралія",
    "about":{
      "title": "Про ресурс",
      "descriptions": {
        "global": "– це путівник у світі кулінарії, який пропонує захоплюючу подорож через різноманітні гастрономічні культури. Хоча харчування єневід'ємною потребою життя, воно також має соціальне значення і приносить людині задоволення. У різних країнах існують унікальні традиції приготування їжі, особливості використання продуктів та кулінарні мистецтва з багатою історією." ,
        "info": "є джерелом інформації, наповнений цікавими даними про різні культури і традиції харчування по всьому світу. Крім того, друга тема, якій тут приділяється увага, – це користь харчування та вплив харчових продуктів на організм людини. Важливо пам'ятати, яке значення має харчування для здоров'я.",
        "pages": "На кожній сторінці, присвяченій певній країні, можна знайти захоплюючу інформацію про її особливості, традиційні страви, місцеві продукти та культуру. В описі кожної страви представлена докладна інформація про її приготування та корисні відомості про харчову цінність та склад інгредієнтів. Це допоможе зробити висновки про корисність представлених рецептів для власного споживання.",
        "data": "Додатково, на решті сторінок гастрономічного гіда представлена цінна інформація про макро- і мікроелементи, що містяться в продуктах, а також доступний повний хімічний склад деяких з найпопулярніших продуктів харчування. Важливо, що ці дані регулярно оновлюватимуться і доповнюватимуть у майбутньому."
      }
    },
    "author":{
      "title": "Про автора",
      "description": {
        "greatest": "Ласкаво прошу на унікальний та пізнавальний ресурс! Мене звуть Шеремет Єлизавета, і я народилася у чудовому місті Одеса, яке знаходиться в Україні.",
        "education": "Я володію двома вищими освітами: одна в галузі технологій харчування, а інша в комп'ютерних науках. Той проект, з яким ви зараз знайомитеся, є результатом моєї магістерської дипломної роботи з другої вищої освіти. Враховуючи актуальність обох галузей, у мене з'явилася приголомшлива ідея об'єднати ці знання та створити цікавий інформаційний ресурс, в який я вклала всі отримані мною знання в обох галузях, доповнених даними з інтернету та літератури.",
        "meaning": "Для мене це не просто дипломна робота чи ще один проект, я вкладаю душу у кожне слово та думку, які хочу передати суспільству. Я впевнена, що цей ресурс стане справжньою знахідкою для мандрівників, гурманів та всіх, кому цікаво пізнавати нове.",
        "experience": "Мої знання у сфері харчування людини підкріплені як теорією, а й практикою. Я перевіряла та застосовувала безліч теоретичних знань під час приготування страв, проводила різні експерименти, які враховувала при збиранні всієї необхідної інформації, якою зараз ділюся з вами тут.",
        "blog": {
          "part1":"У мене також є особистий кулінарний блог у ",
          "part2": ", де можна переглянути процеси приготування деяких страв, які представлені на цьому сайті. Я завжди відкрита для будь-яких пропозицій та зауважень, оскільки вони допоможуть зробити цей ресурс максимально корисним для кожного. Мені хочеться продовжувати розвивати цей проект, покращувати інтерфейс, додавати нові можливості, наповнювати його новими рецептами, оновлювати дані про продукти, і тому я буду рада будь-якому зворотному зв'язку. Адже розвиватись треба разом."
        },
        "gratitude": "Дякую вам за увагу та знайомство зі мною. Я сподіваюся, що вам сподобається мій гастрономічний гід. Приємної подорожі світом смаків!"
      }
    }
  },
  "Footer": {
    "navigation": "Навігація по сайту",
    "home": "Головна",
       "continents": "Континенти",
       "countries": "Країни",
       "recipes": "Рецепти",
       "products": "Продукти",
       "manual": "Довідник",
       "contacts": "Контакти",
       "author": "Про автора",
       "resource": "Про ресурс",
       "feedback": "Зворотній звʼязок"

  }
}