{
    "Header":{
       "home": "Головна",
       "continents": "Континенти",
       "countries": "Країни",
       "recipes": "Рецепти",
       "products": "Продукти",
       "manual": "Довідник",
       "contacts": "Контакти",
       "author": "Про автора",
       "resource": "Про ресурс",
       "auth": "Увійти",
       "registrate": "Створити"
    },
    "Home": {
    "title": "Кухні світу Традиції та особливості",
    "greenland": "Гренландія",
    "na": "Північна Америка",
    "sa": "Південна Америка",
    "asia": "Азія",
    "eu": "Европа",
    "africa": "Африка",
    "au": "Австралія",
    "about":{
      "title": "Про ресурс",
      "descriptions": {
        "global": "– це путівник у світі кулінарії, який пропонує захоплюючу подорож через різноманітні гастрономічні культури. Хоча харчування єневід'ємною потребою життя, воно також має соціальне значення і приносить людині задоволення. У різних країнах існують унікальні традиції приготування їжі, особливості використання продуктів та кулінарні мистецтва з багатою історією." ,
        "info": "є джерелом інформації, наповнений цікавими даними про різні культури і традиції харчування по всьому світу. Крім того, друга тема, якій тут приділяється увага, – це користь харчування та вплив харчових продуктів на організм людини. Важливо пам'ятати, яке значення має харчування для здоров'я.",
        "pages": "На кожній сторінці, присвяченій певній країні, можна знайти захоплюючу інформацію про її особливості, традиційні страви, місцеві продукти та культуру. В описі кожної страви представлена докладна інформація про її приготування та корисні відомості про харчову цінність та склад інгредієнтів. Це допоможе зробити висновки про корисність представлених рецептів для власного споживання.",
        "data": "Додатково, на решті сторінок гастрономічного гіда представлена цінна інформація про макро- і мікроелементи, що містяться в продуктах, а також доступний повний хімічний склад деяких з найпопулярніших продуктів харчування. Важливо, що ці дані регулярно оновлюватимуться і доповнюватимуть у майбутньому."
      }
    }
  },
  "Footer": {
    "navigation": "Навігація по сайту",
    "home": "Головна",
       "continents": "Континенти",
       "countries": "Країни",
       "recipes": "Рецепти",
       "products": "Продукти",
       "manual": "Довідник",
       "contacts": "Контакти",
       "author": "Про автора",
       "resource": "Про ресурс",
       "feedback": "Зворотній звʼязок"

  }
}